<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Meshmixer and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dcoobs.munki.Meshmixer</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Meshmixer</string>
        <key>NAME</key>
        <string>Meshmixer</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string></string>
            <key>description</key>
            <string>Meshmixer is state-of-the-art software for working with triangle meshes. Do you need to clean up a 3D scan, do some 3D printing, or design an object that fits something else? Meshmixer can help. Think of it as a sort of "Swiss Army Knife" for 3D meshes.</string>
            <key>developer</key>
            <string>Autodesk</string>
            <key>display_name</key>
            <string>Meshmixer</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
			<key>uninstall_script</key>
    		<string>#!/bin/sh
                        # Deletes the application.
                        /bin/echo "$CURRENTDATETIME           autodesk_meshmixer: Removing application folder" &gt;&gt; "/Library/Managed Installs/Logs/ManagedSoftwareUpdate.log"
                        /bin/rm -rf "/Applications/Meshmixer.app"
                        # Removes receipts.
                        /bin/echo "$CURRENTDATETIME           autodesk_meshmixer: Removing receipts." &gt;&gt; "/Library/Managed Installs/Logs/ManagedSoftwareUpdate.log"
                        /usr/sbin/pkgutil --forget com.meshmixer.meshmixer09.pkg
                        /usr/sbin/pkgutil --forget com.meshmixer.libmodels.pkg
                        exit 0</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.Meshmixer</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>minimum_os_version</key>
                    <string>10.9.0</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
