<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Kaltura CaptureSpace installer</string>
    <key>Identifier</key>
    <string>com.github.dcoobs.download.CaptureSpace</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CaptureSpace</string>
        <key>URL</key>
        <string>https://www.kaltura.com/api_v3/index.php/service/captureSpace_captureSpace/action/serveinstall/os/Mac OS X</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Download latest Kaltura CaptureSpace disk image</string>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Kaltura CaptureSpace Desktop Recorder.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "rvs.Kaltura-CaptureSpace-Desktop-Recorder" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = X8RDCFJK95)</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
