<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the CrowdStrike Falcon sensor. Imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dcoobs.munki.CSFalcon</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/CSFalcon</string>
        <key>NAME</key>
        <string>CSFalcon</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>A/V</string>
            <key>description</key>
            <string>The CrowdStrike Falcon product is a pioneer in endpoint protection by unifying next generation antivirus, endpoint detection and response (EDR), managed threat hunting, IT hygiene, and threat intelligence - all delivered via a single lightweight agent.</string>
            <key>developer</key>
            <string>CrowdStrike</string>
            <key>display_name</key>
            <string>CrowdStrike Falcon</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>RestartAction</key>
            <string>RequireRestart</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dcoobs.download.CSFalcon</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>minimum_os_version</key>
                    <string>10.13.0</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
